Repository: behtash-fani/Youtube-Telegram-Bot
Catalog: src/locales/*/LC_MESSAGES/messages.po
Languages: fa

source: Please enter a valid YouTube link.
fa: لطفاً یک لینک معتبر از یوتیوب وارد کنید.

source: The link is valid.
fa: لینک معتبر است.

source: Please wait a few moments for the video details to be displayed.
fa: لطفاً چند لحظه منتظر بمانید تا جزئیات ویدیو نمایش داده شود.

source: Video Title
fa: عنوان ویدیو

source: Please choose your preferred quality:
fa: لطفاً کیفیت مورد نظر خود را انتخاب کنید:

source: Download audio file with quality
fa: دانلود فایل صوتی با کیفیت

source: Download video with quality
fa: دانلود ویدیو با کیفیت

source: Please wait...
fa: لطفاً صبر کنید...

source: Download Link
fa: لینک دانلود

source: This link is valid for 1 hour.
fa: این لینک به مدت یک ساعت معتبر است.

source: Please recommend our bot to your friends.
fa: لطفاً ربات ما را به دوستان خود معرفی کنید.

source: An error occurred while downloading the file. Please try again.
fa: هنگام دانلود فایل خطایی رخ داد. لطفاً دوباره تلاش کنید.

source: Please wait a moment. The playlist is being processed...
fa: لطفاً یک لحظه صبر کنید. لیست پخش در حال پردازش است...

source: An error occurred while processing the playlist. Please try again.
fa: هنگام پردازش لیست پخش خطایی رخ داد. لطفاً دوباره تلاش کنید.

source: Number of videos in the playlist:
fa: تعداد ویدیوهای موجود در لیست پخش:

source: Please choose the download quality for all videos
fa: لطفاً کیفیت دانلود برای تمام ویدیوها را انتخاب کنید

source: Downloading videos with quality
fa: در حال دانلود ویدیوها با کیفیت

source: Please wait..
fa: لطفاً صبر کنید..

source: Downloading the next video...
fa: در حال دانلود ویدیوی بعدی...

source: Video Title:
fa: عنوان ویدیو:

source: All videos in the playlist have been successfully downloaded.
fa: همه ویدیوهای موجود در لیست پخش با موفقیت دانلود شدند.

source: Error deleting message or sending photo
fa: خطا در حذف پیام یا ارسال عکس

source: An error occurred while downloading the video. Please try again.
fa: هنگام دانلود ویدیو خطایی رخ داد. لطفاً دوباره تلاش کنید.

source: Hello, welcome to Panda Bot!
fa: سلام، به ربات پاندا خوش آمدید!

source: Send a YouTube video or playlist link:
fa: یک لینک ویدیوی یوتیوب یا لیست پخش ارسال کنید:

source: Bot usage guide:
fa: راهنمای استفاده از ربات:

source: To use the YouTube downloader bot, please follow these guidelines:
fa: برای استفاده از ربات دانلود یوتیوب، لطفاً این دستورالعمل‌ها را دنبال کنید:

source: Allowed links:
fa: لینک‌های مجاز:

source: Regular YouTube video links:
fa: لینک‌های عادی ویدیوهای یوتیوب:

source: Example:
fa: مثال:

source: or:
fa: یا:

source: YouTube playlist links:
fa: لینک‌های لیست پخش یوتیوب:

source: Disallowed links:
fa: لینک‌های غیرمجاز:

source: You can also create a text file with the txt extension and put one of the above links on each line and send it to the bot.
fa: شما همچنین می‌توانید یک فایل متنی با فرمت txt ایجاد کنید و یکی از لینک‌های فوق را در هر خط قرار دهید و آن را برای ربات ارسال کنید.

source: Result of using the bot:
fa: نتیجه استفاده از ربات:

source: After sending an allowed link, the bot will download the video or playlist and provide you with a direct download link from the server with the domain `pandabot.ir`.
fa: پس از ارسال یک لینک مجاز، ربات ویدیو یا لیست پخش را دانلود کرده و یک لینک دانلود مستقیم از سرور با دامنه `pandabot.ir` به شما ارائه می‌دهد.

source: The link you sent is related to WatchLater. Currently, we cannot handle videos in this link
fa: لینکی که ارسال کردید مربوط به WatchLater است. در حال حاضر نمی‌توانیم ویدیوهای این لینک را پردازش کنیم.

source: Please send a single video or playlist link
fa: لطفاً یک لینک ویدیو یا لیست پخش ارسال کنید.

source: The link you sent is related to Liked Videos. Currently, we cannot handle videos in this link
fa: لینکی که ارسال کردید مربوط به ویدیوهای لایک‌شده است. در حال حاضر نمی‌توانیم ویدیوهای این لینک را پردازش کنیم.

source: Number of correct links sent:
fa: تعداد لینک‌های درست ارسال شده:

source: Please choose the download quality for all videos:
fa: لطفاً کیفیت دانلود برای تمام ویدیوها را انتخاب کنید:

source: Please make sure to send a file with a .txt extension.
fa: لطفاً مطمئن شوید که فایلی با فرمت .txt ارسال می‌کنید.

source: No download link was found.
fa: هیچ لینک دانلودی یافت نشد.

source: Please resend the file with a .txt extension.
fa: لطفاً فایل را با فرمت .txt دوباره ارسال کنید.

source: All download links are ready for use in download manager software.
fa: همه لینک‌های دانلود آماده استفاده در نرم‌افزار مدیریت دانلود هستند.

source: MB
fa: مگابایت

source: GB
fa: گیگابایت
