Repository: behtash-fani/Youtube-Telegram-Bot
Catalog: src/i18n/locales/*/LC_MESSAGES/messages.po
Languages: fa

source: To use the YouTube downloader bot, please follow these guidelines:
fa: برای استفاده از ربات دانلود یوتیوب، لطفاً این دستورالعمل‌ها را دنبال کنید:

source: Allowed links:
fa: لینک‌های مجاز:

source: Regular YouTube video links:
fa: لینک‌های معمول ویدیوی یوتیوب:

source: Example:
fa: مثال:

source: or:
fa: یا:

source: YouTube playlist links:
fa: لینک‌های پلی‌لیست یوتیوب:

source: Disallowed links:
fa: لینک‌های غیرمجاز:

source: You can also create a text file with the txt extension and put one of the above links on each line and send it to the bot.
fa: همچنین می‌توانید یک فایل متنی با پسوند txt ایجاد کرده و در هر خط یکی از لینک‌های بالا را قرار دهید و برای ربات ارسال کنید.

source: Result of using the bot:
fa: نتیجه استفاده از ربات:

source: After sending an allowed link, the bot will download the video or playlist and provide you with a direct download link from the server with the domain `pandabot.ir`.
fa: پس از ارسال یک لینک مجاز، ربات ویدیو یا پلی‌لیست را دانلود کرده و لینکی مستقیم از سرور با دامنه `pandabot.ir` در اختیار شما قرار می‌دهد.

source: The link you sent is related to WatchLater. Currently, we cannot handle videos in this link
fa: لینکی که ارسال کردید مربوط به WatchLater است. در حال حاضر امکان پردازش این نوع لینک وجود ندارد.

source: Please send a single video or playlist link
fa: لطفاً تنها یک لینک ویدیو یا پلی‌لیست ارسال کنید.

source: The link you sent is related to Liked Videos. Currently, we cannot handle videos in this link
fa: لینکی که ارسال کردید مربوط به Liked Videos است. در حال حاضر امکان پردازش این نوع لینک وجود ندارد.

source: Want to boost your Instagram followers, likes, or views?
fa: می‌خواهید فالوور، لایک یا بازدید اینستاگرام خود را افزایش دهید؟

source: With Iranigram, choose your desired service in just a few taps and see instant results!
fa: با ایرانگرام، تنها با چند کلیک سرویس مورد نظر خود را انتخاب کرده و نتیجه را فوری ببینید!

source: Perfect for personal, business, and influencer accounts
fa: مناسب برای حساب‌های شخصی، تجاری و اینفلوئنسرها

source: Fair prices, fast delivery, no password required!
fa: قیمت منصفانه، تحویل سریع، بدون نیاز به رمز عبور!

source: Click the button below to get started 👇
fa: برای شروع روی دکمه زیر کلیک کنید 👇

source: Hello, welcome to Panda Bot!
fa: سلام! به ربات پاندا خوش آمدید!

source: Send a YouTube video or playlist link:
fa: یک لینک ویدیوی یوتیوب یا پلی‌لیست ارسال کنید:

source: Bot usage guide:
fa: راهنمای استفاده از ربات:

source: Please enter a valid YouTube link.
fa: لطفاً یک لینک معتبر از یوتیوب وارد کنید.

source: The link is valid. Please wait a few moments for the video details to be displayed.
fa: لینک معتبر است. لطفاً چند لحظه منتظر بمانید تا جزئیات ویدیو نمایش داده شود.

source: Video Title
fa: عنوان ویدیو

source: Please choose your preferred quality:
fa: لطفاً کیفیت مورد نظر خود را انتخاب کنید:

source: Download audio file with quality
fa: دانلود فایل صوتی با کیفیت

source: started
fa: شروع شد

source: Please wait...
fa: لطفاً منتظر بمانید...

source: Download video with quality
fa: دانلود ویدیو با کیفیت

source: Download Link
fa: لینک دانلود

source: This link is valid for 1 hour.
fa: این لینک به مدت ۱ ساعت معتبر است.

source: Please recommend our bot to your friends.
fa: لطفاً ربات ما را به دوستان خود معرفی کنید.

source: Please wait a moment. The playlist is being processed...
fa: لطفاً کمی صبر کنید. پلی‌لیست در حال پردازش است...

source: An error occurred while processing the playlist. Please try again.
fa: در حین پردازش پلی‌لیست خطایی رخ داد. لطفاً دوباره تلاش کنید.

source: Number of videos in the playlist:
fa: تعداد ویدیوها در پلی‌لیست:

source: Please choose the download quality for all videos
fa: لطفاً کیفیت دانلود برای همه ویدیوها را انتخاب کنید.

source: Downloading videos with quality
fa: در حال دانلود ویدیوها با کیفیت

source: started.
fa: شروع شد.

source: Please wait..
fa: لطفاً صبر کنید..

source: Downloading the next video...
fa: در حال دانلود ویدیوی بعدی...

source: Video Title:
fa: عنوان ویدیو:

source: All videos in the playlist have been successfully downloaded.
fa: تمام ویدیوهای موجود در پلی‌لیست با موفقیت دانلود شدند.

source: An error occurred while downloading the video. Please try again.
fa: در هنگام دانلود ویدیو خطایی رخ داد. لطفاً دوباره تلاش کنید.

source: Please make sure to send a file with a .txt extension.
fa: لطفاً مطمئن شوید که فایلی با پسوند .txt ارسال کرده‌اید.

source: No download link was found.
fa: هیچ لینک دانلودی یافت نشد.

source: Please resend the file with a .txt extension.
fa: لطفاً فایل را با پسوند .txt دوباره ارسال کنید.

source: All download links are ready for use in download manager software.
fa: تمام لینک‌های دانلود آماده استفاده در نرم‌افزارهای مدیریت دانلود هستند.

source: MB
fa: مگابایت

source: GB
fa: گیگابایت

source: Enter Iranigram Bot
fa: ورود به ربات ایرانی گرام
